Revit 2027 API
LinkLoadResult.GetNestedLinkLoadResults Method
 Gets the results for this link's nested links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, LinkLoadResult> GetNestedLinkLoadResults()
Public Function GetNestedLinkLoadResults As IDictionary(Of String, LinkLoadResult)
public:
IDictionary<String^, LinkLoadResult^>^ GetNestedLinkLoadResults()
member GetNestedLinkLoadResults : unit -> IDictionary<string, LinkLoadResult>
Return Value
IDictionary<String, LinkLoadResult>
A map from nested link paths to the load results for that nested link.
For links from external servers, the "path" will be the display name of the link.
Remarks
 This function is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.
See Also
Reference
LinkLoadResult Class
Autodesk.Revit.DB Namespace